Table of Contents
 Class IdeaCut
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaCut : AbstractIdeaObject<IIdeaCut>, IEquatable<AbstractIdeaObject<IIdeaCut>>, IIdeaCut, IIdeaPersistentObject, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaCut>
IdeaCut
Implements
IEquatable<AbstractIdeaObject<IIdeaCut>>
IIdeaCut
IIdeaPersistentObject
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaCut>.Id
 AbstractIdeaObject<IIdeaCut>.Name
 AbstractIdeaObject<IIdeaCut>.Identifier
 AbstractIdeaObject<IIdeaCut>.GetHashCode()
 AbstractIdeaObject<IIdeaCut>.Equals(object)
 AbstractIdeaObject<IIdeaCut>.Equals(AbstractIdeaObject<IIdeaCut>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaCut(Identifier<IIdeaCut>)
protected IdeaCut(Identifier<IIdeaCut> identifer)
Parameters
identifer Identifier<IIdeaCut>
 IdeaCut(int)
public IdeaCut(int id)
Parameters
id int
 IdeaCut(string)
public IdeaCut(string id)
Parameters
id string
Properties
 CutMethod
Cut Method
public CutMethod CutMethod { get; set; }
Property Value
CutMethod
 CutOrientation
Cut Orientation
public CutOrientation CutOrientation { get; set; }
Property Value
CutOrientation
 CutPart
Cut part
public CutPart CutPart { get; set; }
Property Value
CutPart
 CuttingObject
Modified Object
public virtual IIdeaObject CuttingObject { get; set; }
Property Value
IIdeaObject
 DistanceComparison
Distance Comparison
public DistanceComparison DistanceComparison { get; set; }
Property Value
DistanceComparison
 ModifiedObject
Modified Object
public virtual IIdeaObject ModifiedObject { get; set; }
Property Value
IIdeaObject
 Offset
Offset
public double Offset { get; set; }
Property Value
double
 Token
Persistence token. Holds data neccessery to recreated the object in future.
public virtual IIdeaPersistenceToken Token { get; set; }
Property Value
IIdeaPersistenceToken
 Weld
Weld of cut
public virtual IIdeaWeld Weld { get; set; }
Property Value
IIdeaWeld
 Edit this page